



 
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	
	ПараметрыРегистрации.Версия = Формат(ТекущаяДатаСеанса(),"ddMMyy")+"/1";
	
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	
	
	ПараметрыРегистрации.БезопасныйРежим = ложь;
	ПараметрыРегистрации.Информация = Метаданные().Синоним + " " + ПараметрыРегистрации.Версия;
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
	
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = Метаданные().Синоним + " (Регламентное)";
	НоваяКоманда.Идентификатор = Метаданные().Имя;
	НоваяКоманда.ПоказыватьОповещение = истина;  
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();   
	
	
	
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = Метаданные().Синоним+" (Форма)";
	НоваяКоманда.Идентификатор = Метаданные().Имя+"Форма";
	НоваяКоманда.ПоказыватьОповещение = истина;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(); //открыть форму обработки
	
	Возврат ПараметрыРегистрации;
КонецФункции 


// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры



// Обработчик вызова команд для обработки
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт 
	
	МассивОшибок = Неопределено;
	ДентексЗаполнитьИерархиюСервер(МассивОшибок);
	
КонецПроцедуры






//Если ТипЗнч(ТекущийОбъект)	=  Тип("ЗадачаОбъект.ЗадачаИсполнителя") Или ТипЗнч(ТекущийОбъект)	=  Тип("БизнесПроцессОбъект.Задание")  Тогда   
	//	Иначе 
	//	Возврат;
	//КонецЕсли;
	//
	//
	//	
	//Если Не ЗначениеЗаполнено(ТекущийОбъект.Исполнитель) Тогда   
	//	Возврат;
	//КонецЕсли;	
	//	
	//
	//Запрос1 = Новый Запрос;
	//Запрос1.Текст = 
	//"ВЫБРАТЬ
	//|	ПользователиДополнительныеРеквизиты.Ссылка КАК Ссылка,
	//|	ПользователиДополнительныеРеквизиты.Ссылка.Подразделение.ТекущийРуководитель КАК ПодразделениеТекущийРуководитель
	//|ИЗ
	//|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	//|ГДЕ
	//|	ПользователиДополнительныеРеквизиты.Свойство.Имя = ""Офис_a044ca2796434b6496bff515a6551860""
	//|	И ВЫРАЗИТЬ(ПользователиДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов).Наименование = ""Виртуальный""
	//|	И ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь";
	//
	//Запрос1.УстановитьПараметр("Пользователь", ТекущийОбъект.Исполнитель); // Отдел продаж Екатеринбург
	//
	//РезультатЗапроса = Запрос1.Выполнить();  
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;	
	//Выборка = РезультатЗапроса.Выбрать();
	//Выборка.Следующий();
	//
	//Если Не ЗначениеЗаполнено(Выборка.ПодразделениеТекущийРуководитель) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СтрРезультат = Новый Структура;
	//СтрРезультат.Вставить("Исполнитель", Выборка.ПодразделениеТекущийРуководитель);
	//СтрРезультат.Вставить("РольИсполнителя", Справочники.РолиИсполнителей.ПустаяСсылка() );
	//СтрРезультат.Вставить("ОсновнойОбъектАдресации", Неопределено);
	//СтрРезультат.Вставить("ДополнительныйОбъектАдресации", Неопределено);
	//СтрРезультат.Вставить("Комментарий", "");
	//
	//мПеренаправляемыеЗадачи = Новый Массив;
	//мПеренаправляемыеЗадачи.Добавить(ТекущийОбъект.Ссылка);

	//БизнесПроцессыИЗадачиСервер.ПеренаправитьЗадачи(мПеренаправляемыеЗадачи, СтрРезультат);
